Revit 2024 API
MaterialPropertyPathType Enumeration
 Enum class indicating kinds of paths which ExternalFileReferenceType.Material references can have.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum MaterialPropertyPathType
Visual Basic
Public Enumeration MaterialPropertyPathType
Visual C++
public enum class MaterialPropertyPathType
Members
Member name | Description
General |  General image, for various material types
Transparency |  Transparency image, for generic materials
Cutouts |  Cutouts image, for generic or metal materials
Bump |  Bump pattern, for generic materials
FinishBumps |  Finish bumps, pattern for various material types
ReliefPattern |  Relief pattern, for various material types
Weathering |  Weathering image, for concrete materials
See Also
Autodesk.Revit.DB Namespace